;________________________________________________________________________________________________________________
;прореживание данных для исходной частоты дискретизации 1кГц
;режим 1 - 250Гц
#define         Mode1Count            4
;режим 2 - 500Гц
#define         Mode2Count            2
;режим 3 - 1000Гц
#define         Mode3Count            1
;________________________________________________________________________________________________________________
;буфер АЦП
#define         ADCSampleSize         9*3
#define         ADCBuffSize           ADCSampleSize*200
;________________________________________________________________________________________________________________
;буфер фильтра
#define         FilterSampleSize      8*4
#define         FilterBuffSize        FilterSampleSize*120
;______________________________________________________________________________________________________
;пауза на включение
_POWERUP_PAUSE_ MACRO
                LOCAL                 Label1
                LOCAL                 Label2
                mov.w                 #36,REG1
Label1          mov.w                 #0xFFFF,REG2
Label2          dec.w                 REG2
                jnz                   Label2
                dec.w                 REG1
                jnz                   Label1
                ENDM
;______________________________________________________________________________________________________
;пауза на включение
_RESET_PAUSE_   MACRO
                LOCAL                 Label
                mov.w                 #2*12,REG2
Label           dec.w                 REG2
                jnz                   Label
                ENDM
;______________________________________________________________________________________________________
;пауза на включение
_RESETEN_PAUSE_ MACRO
                LOCAL                 Label
                mov.w                 #18*12,REG2
Label           dec.w                 REG2
                jnz                   Label
                ENDM
;______________________________________________________________________________________________________
;пауза на включение
_CS_PAUSE_      MACRO
                LOCAL                 Label
                mov.w                 #8*12,REG2
Label           dec.w                 REG2
                jnz                   Label
                ENDM
;______________________________________________________________________________________________________
;пауза на включение
_PWROFF_PAUSE_  MACRO
                LOCAL                 Label
                mov.w                 #25000,REG2
Label           dec.w                 REG2
                jnz                   Label
                ENDM
